Atos-Research-and-Innovation/IoTagent-LoRaWAN/examples/devices/stm32/Drivers/BSP/I_NUCLEO_LRWAN1/i_nucleo_lrwan1_wm_sg_sm_xx.c
/**
  ******************************************************************************
  * @file    i_nucleo_lrwan1_wm_sg_sm_xx.c
  * @author  MCD Application Team
  * @brief   driver I_NUCLEO_LRWAN1 for WM_SG_SM_XX modem board
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include "stm32l0xx_hal.h"
#include "hw_conf.h"
#include "hw_usart.h"
#include "i_nucleo_lrwan1_wm_sg_sm_xx.h"
#include "tiny_sscanf.h"

#include <stdarg.h>
#include "tiny_vsnprintf.h"
#include "debug.h"  





/*!
 * Radio driver structure initialization
 */
const struct Modem_s Modem =
{
  Modem_IO_Init,
  Modem_IO_DeInit,
  Modem_AT_Cmd
  // Lora_Init,             /*there is sense if the lora driver is part of BSP architecture*/           
  // Lora_Join,
  // Lora_SetJoinMode,
  // Lora_GetJoinMode,
  // LoRa_SetKey,
  // LoRa_GetKey,
  // LoRa_SetAppID,
  // LoRa_GetAppID,
  // LoRa_SetDeviceID,
  // LoRa_GetDeviceID,
  // LoRa_SetDeviceAddress,
  // LoRa_GetDeviceAddress,
  // LoRa_SetNetworkID, 
  // LoRa_GetNetworkID,
  // Lora_SetAdaptiveDataRate,
  // Lora_GetAdaptiveDataRate,
  // Lora_SetClass,
  // Lora_GetClass,
  // Lora_SetDutyCycle,
  // Lora_GetDutyCycle,
  // Lora_SetDataRate,
  // Lora_GetDataRate,
  // LoRa_SetFrameCounter,
};



/* External variables --------------------------------------------------------*/
extern ATCmd_t gFlagException;  /*defined in lora_driver.c*/

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/


/* Private macro -------------------------------------------------------------*/


/* Private variables ---------------------------------------------------------*/

char LoRa_AT_Cmd_Buff[DATA_TX_MAX_BUFF_SIZE];    /* Buffer used for AT cmd transmission */

static uint16_t Offset = 0;   /*write position needed for send command*/

static uint8_t aRxBuffer[5];  /* Buffer used for Rx input character */   

static char response[DATA_RX_MAX_BUFF_SIZE];  /*has to be the largest of the response*/
                                              /*not only for return code but also for*/
                                              /*return value: exemple KEY*/

/****************************************************************************/
/*here we have to include a list of AT cmd by the way of #include<file>     */
/*this file will be preprocessed for CmdTab and ATE_RetCode definition      */
/****************************************************************************/

#undef    __ATCMD_MODEM_H__    /*to avoid recursive include*/
#define   AT_CMD_STRING  
#define   AT_ERROR_STRING
#undef    AT_CMD_INDEX
#undef    AT_ERROR_INDEX
#include "atcmd_modem.h"   /*to include WM_SG_SM_42 specific string AT cmd definition*/       


/* Private function prototypes -----------------------------------------------*/
/* private functions ------------------------------------------------------- */


static uint8_t at_cmd_format(ATCmd_t Cmd, void *ptr, Marker_t Marker);

static HAL_StatusTypeDef at_cmd_send(uint16_t len);

static ATEerror_t at_cmd_receive(void *pdata);

static ATEerror_t at_cmd_responseAnalysing(const char *ReturnResp);

static ATEerror_t at_cmd_receive_async_event(void);

static ATEerror_t at_cmd_AsyncEventAnalysing(const char *ReturnResp,int8_t *Flag);

static ATEerror_t at_cmd_receive_async_event_downlink_data(void *ptr);


//static void at_cmd_send_noresp(uint16_t len); 

/* Exported functions ------------------------------------------------------- */


/******************************************************************************
 * @brief  Configures modem UART interface.
 * @param  None
 * @retval AT_OK in case of success
 * @retval AT_UART_LINK_ERROR in case of failure
*****************************************************************************/
ATEerror_t Modem_IO_Init( void )
{
  if ( HW_UART_Modem_Init(BAUD_RATE)== HAL_OK )
  {
    return AT_OK;
  }
  else
  {
    return AT_UART_LINK_ERROR;
  }
}


/******************************************************************************
 * @brief  Deinitialise modem UART interface.
 * @param  None
 * @retval None
*****************************************************************************/
void Modem_IO_DeInit( void )
{
  HAL_UART_MspDeInit(&huart2);
}


/******************************************************************************
 * @brief  Receive data in interrupt mode from modem UART interface.
 * @param  UART handle
 * @retval None
*****************************************************************************/
void Modem_UART_Receive_IT(UART_HandleTypeDef *huart)
{
  /*UART peripheral in reception process for response returned by slave*/  
  if(HAL_UART_Receive_IT(huart, (uint8_t *)aRxBuffer,1) != HAL_OK)
  {
   while (1);
  } 
}

/******************************************************************************
 * @brief  Handle the AT cmd following their Groupp type
 * @param  at_group AT group [control, set , get)
 *         Cmd AT command
 *         pdata pointer to the IN/OUT buffer
 * @retval module status
 *****************************************************************************/
ATEerror_t  Modem_AT_Cmd(ATGroup_t at_group, ATCmd_t Cmd, void *pdata )

{
ATEerror_t Status = AT_END_ERROR;
HAL_StatusTypeDef HAL_Status;
uint16_t Len;  

  /*reset At_cmd buffer for each transmission*/
  memset(LoRa_AT_Cmd_Buff, 0x00, sizeof LoRa_AT_Cmd_Buff); 

  switch (at_group)
  {
  case AT_CTRL:
  {
    Len = at_cmd_format( Cmd, NULL, CTRL_MARKER); 
    HAL_Status = at_cmd_send(Len);
    if(HAL_Status != HAL_OK)
    {  
        return (AT_UART_LINK_ERROR); /*problem on UART transmission*/
    }    
    if(Cmd != AT_RESET)
    {
        Status = at_cmd_receive(NULL);   
        Status = AT_OK;
    }    
    break;
  }  
  case AT_SET:
  {
      Len = at_cmd_format(Cmd, pdata, SET_MARKER); 
      HAL_Status = at_cmd_send(Len);
      if(HAL_Status != HAL_OK)
        return (AT_UART_LINK_ERROR); /*problem on UART transmission*/
      Status = at_cmd_receive(NULL);
    break;
  }  
  case AT_GET:
  {
      Len = at_cmd_format(Cmd, pdata, GET_MARKER);       
      HAL_Status = at_cmd_send(Len);
      if(HAL_Status != HAL_OK)
        return (AT_UART_LINK_ERROR); /*problem on UART transmission*/      
      Status = at_cmd_receive(pdata);
    break;
  }  
  case AT_ASYNC_EVENT:
  {
      if ( Cmd == AT_JOIN)
      Status = at_cmd_receive_async_event(); 
      else
      Status = at_cmd_receive_async_event_downlink_data(pdata);  
    break;    
  }  
  case AT_EXCEPT: 
  {
      HAL_Delay(1000); 
      Len = at_cmd_format(Cmd, pdata, SET_MARKER); 
      HAL_Status = at_cmd_send(Len);     
       if(HAL_Status != HAL_OK)
        return (AT_UART_LINK_ERROR); /*problem on UART transmission*/  
       else
        HAL_Delay(1000); 
      return (AT_OK);
  }        
  case AT_EXCEPT_1:
  {
      Len = at_cmd_format(Cmd, NULL, SET_MARKER); 
      HAL_Status = at_cmd_send(Len);     
       if(HAL_Status != HAL_OK)
          return (AT_UART_LINK_ERROR); /*problem on UART transmission*/  
       else
       {
         /*Status = at_cmd_receive(NULL);*/
         return (AT_OK);    
       }   
  }    
  default:  
    DBG_PRINTF("unknow group\n\r");
    break;
    
