Atos-Research-and-Innovation/IoTagent-LoRaWAN/examples/devices/stm32/Drivers/BSP/I_NUCLEO_LRWAN1/i_nucleo_lrwan1_wm_sg_sm_xx.c
  } /*end switch(at_group)*/
  return Status;
}


/******************************************************************************
 * @brief  format the cmd in order to be send
 * @param  Cmd AT command
 *         ptr generic pointer to the IN/OUT buffer
 *         Marker to discriminate the Set from the Get
 * @retval length of the formated frame to be send
 *****************************************************************************/
static uint8_t at_cmd_format(ATCmd_t Cmd, void *ptr, Marker_t Marker)
{
uint16_t len;      /*length of the formated command*/
//Fmt_t Format;      /*type of format*/
uint8_t *PtrValue; /*for IN/OUT buffer*/
uint32_t value;    /*for 32_02X and 32_D*/
uint8_t value_8;   /*for 8_D*/
//char value_c;      /*for 8_C*/ 

        
 
  switch (Cmd){
  case AT:              /*supported*/
  case AT_RESET:        /*supported*/
  case AT_SLEEP:        /*supported*/ 
  case AT_FWVERSION:    /*supported*/ 
  { 
    /*Format = FORMAT_VOID_PARAM;*/
    len = AT_VPRINTF("%s%s%s",AT_HEADER,CmdTab[Cmd],AT_TAIL);  
    break;
  }
  case  AT_RECV: 
  case  AT_VER:  
  {
    /*Format = FORMAT_PLAIN_TEXT;*/
    if(Marker == SET_MARKER)
    {  
      len = AT_VPRINTF("%s%s%s%d%s%s\r\n",AT_HEADER,CmdTab[Cmd],AT_SET_MARKER,((sSendDataString_t *)ptr)->Port,
                                                              AT_COLON,((sSendDataString_t *)ptr)->Buffer);  
    }                                                          
    else
    {
      len = AT_VPRINTF("%s%s%s%s",AT_HEADER,CmdTab[Cmd],AT_GET_MARKER,AT_TAIL);     
    }
    break;  
  }
  case  AT_SEND:      /*supported - sendB replaced by send - just one send mode on USI*/
  case  AT_RECVB:     /*not supported*/
  {
  /*Format = FORMAT_BINARY_TEXT; */
    if(Marker == SET_MARKER)
    {
      Offset = AT_VPRINTF("%s%s%s%d%s",AT_HEADER,CmdTab[Cmd],AT_SET_MARKER,((sSendDataBinary_t *)ptr)->Port,AT_COMMA); 
      unsigned i;
      for (i = 0; i < ((sSendDataBinary_t *)ptr)->DataSize; i++)
      {
        Offset+=AT_VPRINTF("%02x", ((sSendDataBinary_t *)ptr)->Buffer[i]);
      }
      Offset+=AT_VPRINTF("%s%d%s",AT_COMMA,((sSendDataBinary_t *)ptr)->Ack,AT_TAIL); 
      /*Offset+=AT_VPRINTF("\r\n");*/
      len = Offset;
      Offset = 0;
    }
    else
    {  
      len = AT_VPRINTF("%s%s%s%s",AT_HEADER,CmdTab[Cmd],AT_GET_MARKER,AT_TAIL);         
    }
    break; 
  }
  case AT_APPKEY:    /* USI equivalent AK -- supported*/
  case AT_NWKSKEY:   /* USI equivalent NSK -- supported*/
  case AT_APPSKEY:   /* USI equivalent ASK -- supported*/
  {
    /*Format = FORMAT_16_02X_PARAM;*/
    PtrValue = (uint8_t*) ptr;     
    if(Marker == SET_MARKER) 
    {  
      len = AT_VPRINTF("%s%s%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s", 
                      AT_HEADER,CmdTab[Cmd],AT_SET_MARKER,
                      PtrValue[0],AT_SEPARATOR, PtrValue[1],AT_SEPARATOR, 
                      PtrValue[2],AT_SEPARATOR, PtrValue[3],AT_SEPARATOR,
                      PtrValue[4],AT_SEPARATOR, PtrValue[5],AT_SEPARATOR, 
          PtrValue[6],AT_SEPARATOR, PtrValue[7],AT_SEPARATOR,
                      PtrValue[8],AT_SEPARATOR, PtrValue[9],AT_SEPARATOR, 
          PtrValue[10],AT_SEPARATOR, PtrValue[11],AT_SEPARATOR,
                      PtrValue[12],AT_SEPARATOR, PtrValue[13],AT_SEPARATOR, 
          PtrValue[14],AT_SEPARATOR, PtrValue[15], AT_TAIL); 
    }     
    else
    { 
      len = AT_VPRINTF("%s%s%s%s",AT_HEADER,CmdTab[Cmd],AT_GET_MARKER,AT_TAIL);    
    }  
    break;
  }
  case AT_DADDR:       /*supported*/
  case AT_NWKID:       /*N/A*/
  {
    /*Format = FORMAT_32_02X_PARAM;*/
    value =  *(uint32_t*)ptr;    
    if(Marker == SET_MARKER)
    {  
      len = AT_VPRINTF("%s%s%s%02x%s%02x%s%02x%s%02x%s",AT_HEADER,CmdTab[Cmd],AT_SET_MARKER,
                    (unsigned)((unsigned char *)(&value))[3], AT_SEPARATOR,
                    (unsigned)((unsigned char *)(&value))[2], AT_SEPARATOR,
                    (unsigned)((unsigned char *)(&value))[1], AT_SEPARATOR,
                    (unsigned)((unsigned char *)(&value))[0], AT_TAIL);
    }                 
    else
    {  
      len = AT_VPRINTF("%s%s%s%s",AT_HEADER,CmdTab[Cmd],AT_GET_MARKER,AT_TAIL);   
    }      
    break;
  }
  case AT_APPEUI:     /*supported*/
  case AT_DEUI:       /* USI equivalent EUI - not relevant for SET since burned unique IEEE EUI64 at factory. */
  {
    /*Format = FORMAT_8_02X_PARAM;*/
    PtrValue = (uint8_t*)ptr; 
    if(Marker == SET_MARKER)
    { 
      len = AT_VPRINTF("%s%s%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s%02x%s",
                      AT_HEADER,CmdTab[Cmd],AT_SET_MARKER,
                      PtrValue[0],AT_SEPARATOR, PtrValue[1],AT_SEPARATOR, PtrValue[2],AT_SEPARATOR,
                      PtrValue[3],AT_SEPARATOR, PtrValue[4],AT_SEPARATOR, PtrValue[5],AT_SEPARATOR, 
                      PtrValue[6],AT_SEPARATOR, PtrValue[7],AT_TAIL);   
    }                  
    else
    { 
      len = AT_VPRINTF("%s%s%s%s",AT_HEADER,CmdTab[Cmd],AT_GET_MARKER,AT_TAIL);       
    }
    break;
  }
  case  AT_RX2FQ:    /*N/A*/
  case  AT_RX1DL:    /* USI equivalent RX1DT supported*/
  case  AT_RX2DL:    /* USI equivalent RX2DT - supported*/
  case  AT_JN1DL:    /* USI equivalent JRX1DT - supported*/
  case  AT_JN2DL:    /* USI equivalent JRX2DT - supported*/
  case  AT_FCU:      /* USI equivalent -> not supported*/
  case  AT_FCD:      /* USI equivalent -> not supported*/
  {
    /*Format = FORMAT_32_D_PARAM;*/
    if(Marker == SET_MARKER)
    {    
      value =  *(uint32_t*)ptr;    
      len = AT_VPRINTF("%s%s%s%u%s",AT_HEADER,CmdTab[Cmd],AT_SET_MARKER,value, AT_TAIL); 
    }
    else
    {  
      len = AT_VPRINTF("%s%s%s%s",AT_HEADER,CmdTab[Cmd],AT_GET_MARKER,AT_TAIL); 
    }  
    break; 
  }
  case  AT_JOIN:        /* supported*/
  case  AT_ATE:         /* supported*/
  case  AT_DR:          /* supported*/
  case  AT_RX2DR:       /* supported*/
  case  AT_BAND:        /* supported*/  
  case  AT_TXP:         /* N/A*/
  case  AT_NJM:         /* N/A*/
  case  AT_PNM:         /* supported - USI equivalent NTYP*/
  case  AT_DCS:         /* supported - USI equivalent DC - Disabling duty cycle for testing only. It should be enabled for shipping*/
  case  AT_ADR:         /* supported*/
  case  AT_CFM:         /* N/A*/
  case  AT_CFS:         /* N/A*/
  case  AT_BAT:         /* supported*/
  case  AT_RSSI:        /* not supported by USI FW version*/
  case  AT_SNR:         /* not supported by USI FW version*/
  case  AT_NJS:         /* N/A*/
  case  AT_CLASS:       /* not supported on V2.5 USI FW version*/
  case  AT_WDCT:        /* supported*/ 
  {
    /*Format = FORMAT_8_D_PARAM;*/
    if(Marker == SET_MARKER)
    {  
      value_8 =  *(uint8_t*)ptr;    
      len = AT_VPRINTF("%s%s%s%d%s",AT_HEADER,CmdTab[Cmd],AT_SET_MARKER,value_8,AT_TAIL);   
    }
    else
    {
      len = AT_VPRINTF("%s%s%s%s",AT_HEADER,CmdTab[Cmd],AT_GET_MARKER,AT_TAIL);  
    }   
    break;  
  }
  case AT_PS:
  {
    if(Marker == SET_MARKER)
    {  
      /*value_8 =  *(uint8_t*)ptr;*/
      len = AT_VPRINTF("%s%s%s%d,%d%s",AT_HEADER,CmdTab[Cmd],AT_SET_MARKER,
                      ((sPowerCtrlSet_t *)ptr)->SetType,((sPowerCtrlSet_t *)ptr)->Value,AT_TAIL);     
    }
    else
    {
      len = AT_VPRINTF("%s%s%s%s",AT_HEADER,CmdTab[Cmd],AT_GET_MARKER,AT_TAIL);  
    }   
    break;     
  }
  default:  
    len = AT_VPRINTF("%s%s%s",AT_HEADER,CmdTab[Cmd],AT_TAIL);  
    DBG_PRINTF ("format not yet supported \n\r");
    break;
} /*end switch(cmd)*/       
   return len;
}


