Atos-Research-and-Innovation/IoTagent-LoRaWAN/examples/devices/stm32/Drivers/BSP/I_NUCLEO_LRWAN1/i_nucleo_lrwan1_wm_sg_sm_xx.c
/******************************************************************************
  * @brief This function sends an AT cmd to the slave device
  * @param len: length of the AT cmd to be sent
  * @retval HAL return code
******************************************************************************/
static HAL_StatusTypeDef at_cmd_send(uint16_t len)
{
HAL_StatusTypeDef RetCode;

  /*transmit the command from master to slave*/
  RetCode = HAL_UART_Transmit(&huart2, (uint8_t*)LoRa_AT_Cmd_Buff, len, 5000);
  return ( RetCode);  
}



/******************************************************************************
  * @brief This function receives response from the slave device
  * @param pdata: pointeur to the value returned by the slave
  * @retval return code coming from slave
******************************************************************************/ 
static ATEerror_t at_cmd_receive(void *pdata)
{
uint8_t  ResponseComplete = 0;
int8_t i = 0;
int8_t charnumber = 0;
char *ptrChr;
ATEerror_t RetCode;
uint8_t NoReturnCode =1;   /*to discriminate the Get return code from return value*/
  
  /*cleanup the response buffer*/
  memset(response, 0x00, 16); 

  /*UART peripheral in reception process for response returned by slave*/  
  if(HAL_UART_Receive_IT(&huart2, (uint8_t *)aRxBuffer,1) != HAL_OK)
  {
   while (1);
  } 
  
   
  while (!ResponseComplete)
  {  
   
      while (HW_UART_Modem_IsNewCharReceived() == RESET);   
    
      /*process the response*/    
      response[i] = HW_UART_Modem_GetNewChar();
         
      /*wait up to carriage return OR the line feed marker*/
       if (/*(response[i] =='\r') || */(response[i] == '\n'))
       {
        if(pdata == NULL) /*return code following a SET cmd or simple AT cmd*/
        { 
          if (i>1)  /*return code following a SET cmd or simple AT cmd- we skip the first <cr><ln>*/
          {
            i= 0;
            ResponseComplete = 1;
            RetCode = at_cmd_responseAnalysing(&response[2]);  /* to skip the '\0' in position [0]*/
            break;
          }  
        }
        else    /* returned value following a GET cmd */
        {
          if (i!= 0 && NoReturnCode)
          {
            /*first statement to get back the return value*/
            response[i] = '\0';
            if (gFlagException != AT_FWVERSION)         /*see comment in loara_driver.c*/
            {  
              ptrChr = strchr(&response[1],'=');       /*to skip the '\0''\r'*/
              strcpy(pdata,ptrChr+1);
              gFlagException = AT_END_AT;
            }
            else
            { 
              strcpy(pdata,&response[1]);  
            } 
            memset(response, 0x00, 16);
            i= -1;             /*to compensate the next index iteration and restart in [0]*/
            NoReturnCode = 0;  /*return code for the Get cmd*/
          }
          else
          {
            if (i>1)
            { 
              /*second statement to get back the return code*/
              i= 0;
              ResponseComplete = 1;   /*when value + return code have been trapped*/
              RetCode = at_cmd_responseAnalysing(response);
              memset(response, 0x00, 16);
              break;        
            }   
          }
        }  
       }   
       else
       {
        if (i ==  (DATA_RX_MAX_BUFF_SIZE-1)) /* frame overflow */           
         {  
           i = 0; 
           return (AT_TEST_PARAM_OVERFLOW);
         } 
       }
        i++;
      HAL_UART_Receive_IT(&huart2, (uint8_t *)aRxBuffer,1) ;
      charnumber++;
  } 
      huart2.gState = HAL_UART_STATE_READY;
      huart2.RxState = HAL_UART_STATE_READY;        /*to be checked since was validated with previous */
      return ( RetCode);                            /*version of HAL .. there was not Rx field state*/
}




/******************************************************************************
  * @brief This function receives asynchronus event from the slave device
  * @param none
  * @retval return code coming from slave
******************************************************************************/ 
static ATEerror_t at_cmd_receive_async_event(void)
{
uint8_t  ResponseComplete = 0;
int8_t i = 0;
int8_t charnumber = 0;
char *ptrChr;
ATEerror_t RetCode;
uint8_t NoReturnCode =1;   /*too discriminate the Get reurn code from return value*/
  
  /*cleanup the response buffer*/
  memset(response, 0x00, 16); 

  /*UART peripheral in reception process for response returned by slave*/  
  if(HAL_UART_Receive_IT(&huart2, (uint8_t *)aRxBuffer,1) != HAL_OK)
  {
   while (1);
  } 
  
  while (!ResponseComplete)
  {  
   
    while (HW_UART_Modem_IsNewCharReceived() == RESET);   
    
    /*process the response*/    
    response[i] = HW_UART_Modem_GetNewChar();
            
    /*wait up to carriage return OR the line feed marker*/
    if (/*(response[i] =='\r') || */(response[i] == '\n'))       
    {
      if (i!= 0 && NoReturnCode)      /*trap the asynchronous event*/
      {
        /*first statement to get back the return value*/
        response[i] = '\0';
        ptrChr = strchr(&response[1],'+');       /*to skip the '\0''\r'*/
        RetCode = at_cmd_AsyncEventAnalysing(ptrChr,NULL);
        memset(response, 0x00, 16);
        i= -1;             /*to compensate the next index iteration and restart in [0]*/
        NoReturnCode = 0;  /*return code for the Get cmd*/
        break;
      }
      else
      {
        if (i>1)
        { 
          /*second statement to get back the return code*/
          i= 0;
          ResponseComplete = 1;   /*when value + return code have been trapped*/
          RetCode = at_cmd_responseAnalysing(response);
          memset(response, 0x00, 16);
          break;        
        }   
      }
    }   
    else
    {
      if (i ==  (DATA_RX_MAX_BUFF_SIZE-1)) /* frame overflow */           
      {  
        i = 0; 
        return (AT_TEST_PARAM_OVERFLOW);
      } 
    }
      i++;
      HAL_UART_Receive_IT(&huart2, (uint8_t *)aRxBuffer,1) ;
      charnumber++;
  } 
      huart2.gState = HAL_UART_STATE_READY;
      huart2.RxState = HAL_UART_STATE_READY;        /*to be checked since was validated with previous */
      return ( RetCode);                            /*version of HAL .. there was not Rx field state*/
}



