Atos-Research-and-Innovation/IoTagent-LoRaWAN/examples/devices/stm32/Drivers/BSP/I_NUCLEO_LRWAN1/i_nucleo_lrwan1_wm_sg_sm_xx.c
/******************************************************************************
  * @brief This function receives asynchronus event from the slave device
  * @param none
  * @retval return code coming from slave
******************************************************************************/ 
static ATEerror_t at_cmd_receive_async_event_downlink_data(void *pdata)
{

int8_t i = 0;
int8_t charnumber = 0;
char *ptrChr;
ATEerror_t RetCode;
uint8_t NoReturnCode =1;   /*too discriminate the Get reurn code from return value*/
int8_t DlinkData_Complete = (0x1U);

  /*cleanup the response buffer*/
  memset(response, 0x00, 16); 

  /*UART peripheral in reception process for response returned by slave*/  
  if(HAL_UART_Receive_IT(&huart2, (uint8_t *)aRxBuffer,1) != HAL_OK)
  {
   while (1);
  } 
  
   
  while ( !(DlinkData_Complete & (0x1u <<2)))   /*received sequence not complete*/
  {  
   
    while (HW_UART_Modem_IsNewCharReceived() == RESET);   
    
    /*process the response*/    
    response[i] = HW_UART_Modem_GetNewChar();
            
      /*wait up to carriage return OR the line feed marker*/
       if ((response[i] =='\r') || (response[i] == '\n'))        
       {
          if (i!= 0 && NoReturnCode)      /*trap the asynchronous events associated to network downlink data*/
          {
            /*sequence of events to be trapped: +RXPORT , +PAYLOADSIZE , +RCV*/
            response[i] = '\0';
            ptrChr = strchr(&response[0],'+');   /*Here when we go out from low power mode the prefix is*/
                                                /* '\r' only. We do not skip the '\0''\r' - USI behavior ...*/
            RetCode = at_cmd_AsyncEventAnalysing(ptrChr,&DlinkData_Complete);
            if(RetCode == AT_OK)
            {
                ptrChr = strchr(&response[1],'=');       /*to skip the '\0''\r'*/
                strcpy(pdata,ptrChr+1);
                pdata = (char*)pdata + strlen(ptrChr+1);
                *((char*)pdata) = ',';                  /* introduce separator in order to discriminate port, size and data*/
                pdata = (char*)pdata + 1;
            }   
                
            memset(response, 0x00, 16);
            i= -1;             /*to compensate the next index iteration and restart in [0]*/
//      NoReturnCode = 0;  /*return code for the Get cmd*/
//                  break;
          } 
       }   
       else
       {
          if (i ==  (DATA_RX_MAX_BUFF_SIZE-1)) /* frame overflow */           
          {  
            i = 0; 
            return (AT_TEST_PARAM_OVERFLOW);
          } 
       }
       i++;
       HAL_UART_Receive_IT(&huart2, (uint8_t *)aRxBuffer,1) ;
       charnumber++;
  } 
       huart2.gState = HAL_UART_STATE_READY;
       huart2.RxState = HAL_UART_STATE_READY;        /*to be checked since was validated with previous */
       return ( RetCode);                            /*version of HAL .. there was not Rx field state*/
}

/******************************************************************************
  * @brief This function does analysis of the response received by the device
  * @param response: pointer to the received response
  * @retval ATEerror_t error type 
******************************************************************************/
static ATEerror_t at_cmd_responseAnalysing(const char *ReturnResp)
{
ATEerror_t status;
int i;

    status = AT_END_ERROR;

    for (i = 0; i < AT_END_ERROR; i++)
    {   
      if (strncmp(ReturnResp, ATE_RetCode[i].RetCodeStr, (ATE_RetCode[i].SizeRetCodeStr-1)) == 0)
      {
        /* command has been found found*/
        status = ATE_RetCode[i].RetCode;
        return (status);
      }          
    }
      return (status);
}



/******************************************************************************
  * @brief This function does analysis of the asynchronous event received by the device
  * @param response: pointer to the received response
  * @retval ATEerror_t error type 
******************************************************************************/
static ATEerror_t at_cmd_AsyncEventAnalysing(const char *ReturnResp, int8_t *Flag)
{
ATEerror_t status;

    status = AT_END_ERROR;

    if (strncmp(ReturnResp, "+JoinAccepted\r", sizeof("+JoinAccepted\r")-1) == 0)
    {
      /* event has been identified*/
      status = AT_OK;
      return (status);
    }     
    
    /*following statements for network downlink data analysis*/
    if (strncmp(ReturnResp, "+RXPORT", sizeof("+RXPORT")-1) == 0)
    {
      /* event has been identified*/
      *Flag <<= (0x0U);
      status = AT_OK;
      return (status);
    }
    
    /*following statement for network downlink data*/
    if (strncmp(ReturnResp, "+PAYLOADSIZE", sizeof("+PAYLOADSIZE")-1) == 0)
    {
      /* event has been identified*/
      *Flag <<= (0x1U);
      status = AT_OK;
      return (status);
    }
    
    /*following statement for network downlink data*/
    if (strncmp(ReturnResp, "+RCV", sizeof("+RCV")-1) == 0)
    {
      /* event has been identified*/
      *Flag <<= (0x1U); 
      status = AT_OK;
      return (status);
    }

    return (status);
}
/******************************************************************************
  * @brief This function sends an AT cmd to the slave device
  * @brief It is an AT cmd without response from slave device
  * @param len: length of the AT cmd to be sent
  * @retval void
******************************************************************************/ 
//static void at_cmd_send_noresp(uint16_t len)
//{
//  /*transmit the command from master to slave*/
//  if(HAL_UART_Transmit(&huart2, (uint8_t*)LoRa_AT_Cmd_Buff, len, 5000) != HAL_OK) 
//  {
//   while (1);
//  } 
//}




/******************************************************************************
  * @brief format the AT frame to be sent to the modem (slave)
  * @param pointer to the format string
  * @retval len of the string to be sent
******************************************************************************/
uint16_t at_cmd_vprintf(const char *format, ...)
{
va_list args;
uint16_t len;
   
  va_start(args, format);
  
  len = tiny_vsnprintf_like(LoRa_AT_Cmd_Buff+Offset, sizeof(LoRa_AT_Cmd_Buff)-Offset, format, args);
  
  va_end(args);
  
  return len;
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
